In [55]:
# https://full-stack-bigdata-datasets.s3.eu-west-3.amazonaws.com/Machine+Learning+non+Supervis%C3%A9/Projects/uber-trip-data.zip

import pandas as pd
import numpy as np

In [56]:

linker = pd.read_csv("src/uber-raw-data-janjune-15.csv")

linker = linker.drop(columns=['Dispatching_base_num', 'Pickup_date'])
linker = linker.drop_duplicates(subset=['locationID'])

In [57]:
linker = linker.sort_values(by=['locationID']).dropna().reset_index().drop(columns=['index'])

In [58]:
taxi_zone_lookup = pd.read_csv("src/taxi-zone-lookup.csv")
uber_raw = pd.read_csv("src/uber-raw-data-jun14.csv")

for dataset in [uber_raw, linker, taxi_zone_lookup]:
    display(dataset.head(5))
    print(len(dataset))

          Date/Time      Lat      Lon    Base
0  6/1/2014 0:00:00  40.7293 -73.9920  B02512
1  6/1/2014 0:01:00  40.7131 -74.0097  B02512
2  6/1/2014 0:04:00  40.3461 -74.6610  B02512
3  6/1/2014 0:04:00  40.7555 -73.9833  B02512
4  6/1/2014 0:07:00  40.6880 -74.1831  B02512

663844

  Affiliated_base_num  locationID
0              B02764           1
1              B02682           2
2              B02764           3
3              B02401           4
4              B02598           5

258

   LocationID        Borough                     Zone
0           1            EWR           Newark Airport
1           2         Queens              Jamaica Bay
2           3          Bronx  Allerton/Pelham Gardens
3           4      Manhattan            Alphabet City
4           5  Staten Island            Arden Heights

265

In [59]:
linker = linker.drop_duplicates(subset=['Affiliated_base_num'])
taxi_zone_lookup = taxi_zone_lookup.drop_duplicates(subset=['LocationID'])

dataset = pd.merge(uber_raw, linker, left_on='Base', right_on='Affiliated_base_num')
dataset = pd.merge(dataset, taxi_zone_lookup, left_on='locationID', right_on='LocationID')
dataset = dataset.dropna()
dataset = dataset.drop_duplicates()
len(dataset)

653158

In [60]:
dataset = dataset.reset_index().dropna().drop(columns=['index','Base','locationID','LocationID'])

In [61]:
dataset.dtypes

Date/Time               object
Lat                    float64
Lon                    float64
Affiliated_base_num     object
Borough                 object
Zone                    object
dtype: object

In [62]:
dataset["Date/Time"] = pd.to_datetime(dataset["Date/Time"])

In [63]:
dataset['Year'] = dataset['Date/Time'].dt.year
dataset['Month'] = dataset['Date/Time'].dt.month
dataset['Day'] = dataset['Date/Time'].dt.day
dataset['DayOfWeek'] = dataset['Date/Time'].dt.day_name()
dataset = dataset.drop(columns=['Date/Time'])
dataset.head()

,Lat,Lon,Affiliated_base_num,Borough,Zone,Year,Month,Day,DayOfWeek
0,40.7293,-73.9920,B02512,Brooklyn,East New York,2014,6,1,Sunday
1,40.7131,-74.0097,B02512,Brooklyn,East New York,2014,6,1,Sunday
2,40.3461,-74.6610,B02512,Brooklyn,East New York,2014,6,1,Sunday
3,40.7555,-73.9833,B02512,Brooklyn,East New York,2014,6,1,Sunday
4,40.6880,-74.1831,B02512,Brooklyn,East New York,2014,6,1,Sunday

In [64]:
print(dataset.dtypes)

Lat                    float64
Lon                    float64
Affiliated_base_num     object
Borough                 object
Zone                    object
Year                     int64
Month                    int64
Day                      int64
DayOfWeek               object
dtype: object

In [65]:
dataset.to_csv(r'src/dataset.csv', index=False)